Doly02/nxp-mcxn947-datalogger/application/board/pin_mux.c
/*
 * Copyright 2022-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MCXN947
package_id: MCXN947VDF
mcu_data: ksdk2_0
processor_version: 0.14.14
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"
#include "fsl_gpio.h"
#include "defs.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P0, pin_signal: PIO1_8/WUU0_IN10/LPTMR1_ALT3/TRACE_DATA0/FC4_P0/FC5_P4/CT_INP8/SCT0_OUT2/FLEXIO0_D16/PLU_OUT0/ENET0_TXD2/I3C1_SDA/TSI0_CH17/ADC1_A8,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable,
    invert_input: normal}
  - {pin_num: B1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P1, pin_signal: PIO1_9/TRACE_DATA1/FC4_P1/FC5_P5/CT_INP9/SCT0_OUT3/FLEXIO0_D17/PLU_OUT1/ENET0_TXD3/I3C1_SCL/TSI0_CH18/ADC1_A9,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{

	/* Enables the clock for PORT1: Enables clock */
	CLOCK_EnableClock(kCLOCK_Port0);
    CLOCK_EnableClock(kCLOCK_Port2);
    CLOCK_EnableClock(kCLOCK_Port4);

#if (true == CONTROL_LED_ENABLED)

	/* enable clock for GPIOs*/
	CLOCK_EnableClock(kCLOCK_Gpio0);
    CLOCK_EnableClock(kCLOCK_Gpio2);
    CLOCK_EnableClock(kCLOCK_Gpio4);

    gpio_pin_config_t gpio0_7_pin_config = {
    		.pinDirection = kGPIO_DigitalOutput,
    		.outputLogic = 0U
    	};
	GPIO_PinInit(GPIO0, 7U, &gpio0_7_pin_config);

	const port_pin_config_t port0_7_pin_config = {/* Internal pull-up/down resistor is disabled */
													  kPORT_PullDisable,
													  /* Low internal pull resistor value is selected. */
													  kPORT_LowPullResistor,
													  /* Fast slew rate is configured */
													  kPORT_FastSlewRate,
													  /* Passive input filter is disabled */
													  kPORT_PassiveFilterDisable,
													  /* Open drain output is disabled */
													  kPORT_OpenDrainDisable,
													  /* Low drive strength is configured */
													  kPORT_LowDriveStrength,
													  /* Pin is configured as PIO0_10 */
													  kPORT_MuxAlt0,
													  /* Digital input enabled */
													  kPORT_InputBufferEnable,
													  /* Digital input is not inverted */
													  kPORT_InputNormal,
													  /* Pin Control Register fields [15:0] are not locked */
													  kPORT_UnlockRegister};
	PORT_SetPinConfig(PORT0, 7U, &port0_7_pin_config);


    gpio_pin_config_t gpio0_9_pin_config = {
    		.pinDirection = kGPIO_DigitalOutput,
    		.outputLogic = 0U
    	};
	GPIO_PinInit(GPIO0, 9U, &gpio0_9_pin_config);

	const port_pin_config_t port0_9_pin_config = {/* Internal pull-up/down resistor is disabled */
													  kPORT_PullDisable,
													  /* Low internal pull resistor value is selected. */
													  kPORT_LowPullResistor,
													  /* Fast slew rate is configured */
													  kPORT_FastSlewRate,
													  /* Passive input filter is disabled */
													  kPORT_PassiveFilterDisable,
													  /* Open drain output is disabled */
													  kPORT_OpenDrainDisable,
													  /* Low drive strength is configured */
													  kPORT_LowDriveStrength,
													  /* Pin is configured as PIO0_10 */
													  kPORT_MuxAlt0,
													  /* Digital input enabled */
													  kPORT_InputBufferEnable,
													  /* Digital input is not inverted */
													  kPORT_InputNormal,
													  /* Pin Control Register fields [15:0] are not locked */
													  kPORT_UnlockRegister};
	PORT_SetPinConfig(PORT0, 9U, &port0_9_pin_config);

    gpio_pin_config_t gpio0_13_pin_config = {
    		.pinDirection = kGPIO_DigitalOutput,
    		.outputLogic = 0U
    	};
	GPIO_PinInit(GPIO0, 13U, &gpio0_13_pin_config);

	const port_pin_config_t port0_13_pin_config = {/* Internal pull-up/down resistor is disabled */
													  kPORT_PullDisable,
													  /* Low internal pull resistor value is selected. */
													  kPORT_LowPullResistor,
													  /* Fast slew rate is configured */
													  kPORT_FastSlewRate,
													  /* Passive input filter is disabled */
													  kPORT_PassiveFilterDisable,
													  /* Open drain output is disabled */
													  kPORT_OpenDrainDisable,
													  /* Low drive strength is configured */
													  kPORT_LowDriveStrength,
													  /* Pin is configured as PIO0_10 */
													  kPORT_MuxAlt0,
													  /* Digital input enabled */
													  kPORT_InputBufferEnable,
													  /* Digital input is not inverted */
													  kPORT_InputNormal,
													  /* Pin Control Register fields [15:0] are not locked */
													  kPORT_UnlockRegister};
	PORT_SetPinConfig(PORT0, 13U, &port0_13_pin_config);


	gpio_pin_config_t gpio2_11_pin_config = {
		.pinDirection = kGPIO_DigitalOutput,
		.outputLogic = 0U
	};
	GPIO_PinInit(GPIO2, 11U, &gpio2_11_pin_config);

	const port_pin_config_t port2_11_pin_config = {/* Internal pull-up/down resistor is disabled */
													  kPORT_PullDisable,
													  /* Low internal pull resistor value is selected. */
													  kPORT_LowPullResistor,
													  /* Fast slew rate is configured */
													  kPORT_FastSlewRate,
													  /* Passive input filter is disabled */
													  kPORT_PassiveFilterDisable,
													  /* Open drain output is disabled */
													  kPORT_OpenDrainDisable,
													  /* Low drive strength is configured */
													  kPORT_LowDriveStrength,
													  /* Pin is configured as PIO0_10 */
													  kPORT_MuxAlt0,
													  /* Digital input enabled */
													  kPORT_InputBufferEnable,
													  /* Digital input is not inverted */
													  kPORT_InputNormal,
													  /* Pin Control Register fields [15:0] are not locked */
													  kPORT_UnlockRegister};
	PORT_SetPinConfig(PORT2, 11U, &port2_11_pin_config);

    gpio_pin_config_t gpio4_17_pin_config = {
		.pinDirection = kGPIO_DigitalOutput,
		.outputLogic = 0U
	};
	GPIO_PinInit(GPIO4, 17U, &gpio4_17_pin_config);

	const port_pin_config_t port4_17_pin_config = {/* Internal pull-up/down resistor is disabled */
													  kPORT_PullDisable,
													  /* Low internal pull resistor value is selected. */
													  kPORT_LowPullResistor,
													  /* Fast slew rate is configured */
													  kPORT_FastSlewRate,
													  /* Passive input filter is disabled */
													  kPORT_PassiveFilterDisable,
													  /* Open drain output is disabled */
													  kPORT_OpenDrainDisable,
													  /* Low drive strength is configured */
													  kPORT_LowDriveStrength,
													  /* Pin is configured as PIO0_10 */
													  kPORT_MuxAlt0,
													  /* Digital input enabled */
													  kPORT_InputBufferEnable,
													  /* Digital input is not inverted */
													  kPORT_InputNormal,
													  /* Pin Control Register fields [15:0] are not locked */
													  kPORT_UnlockRegister};
	/* PORT4_17 is configured as PIO4_17 */
	PORT_SetPinConfig(PORT4, 17U, &port4_17_pin_config);
#endif /* (true == CONTROL_LED_ENABLED) */

#if (true == PWRLOSS_DETECTION_ENABLED)

#if (true == PWRLOSS_TEST_GPIOS)
    gpio_pin_config_t gpio0_15pin_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin B12)  */
    GPIO_PinInit(GPIO0, 15U, &gpio0_15pin_config);

    const port_pin_config_t port0_15_pin_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Pin is configured as PIO0_10 */
                                                      kPORT_MuxAlt0,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT0_15 is configured as PIO0_15 */
    PORT_SetPinConfig(PORT0, 15U, &port0_15_pin_config);

