Doly02/nxp-mcxn947-datalogger/application/board/pin_mux.c
void BOARD_DeinitPins(void)
{
    CLOCK_EnableClock(kCLOCK_Port0);
    CLOCK_EnableClock(kCLOCK_Port1);
    CLOCK_EnableClock(kCLOCK_Port2);
    CLOCK_EnableClock(kCLOCK_Port3);
    CLOCK_EnableClock(kCLOCK_Port4);

    port_pin_config_t default_config = {
        kPORT_PullDisable,
        kPORT_LowPullResistor,
        kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable,
        kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength,
        kPORT_MuxAlt0,             // PIO/GPIO mode
        kPORT_InputBufferEnable,
        kPORT_InputNormal,
        kPORT_UnlockRegister
    };

#if (true == TEMPERATURE_MEAS_ENABLED)
    PORT_SetPinConfig(PORT1, 16U, &default_config);
    PORT_SetPinConfig(PORT1, 17U, &default_config);
#endif

#if (true == PWRLOSS_DETECTION_ENABLED)

#if (true == PWRLOSS_TEST_GPIOS)
    /* Used For Validation of Power Loss Detection */
    //PORT_SetPinConfig(PORT0, 15U, &default_config);
    //PORT_SetPinConfig(PORT0, 23U, &default_config);
#endif /* (true == PWRLOSS_TEST_GPIOS) */

    PORT_SetPinConfig(PORT0, 22U, &default_config); // CMP1_IN2

#endif /* (true == PWRLOSS_DETECTION_ENABLED) */

#if (true == CONTROL_LED_ENABLED)
    PORT_SetPinConfig(PORT0, 7U,  &default_config);
    PORT_SetPinConfig(PORT0, 9U,  &default_config);
    PORT_SetPinConfig(PORT0, 13U, &default_config);
    PORT_SetPinConfig(PORT2, 11U, &default_config);
    PORT_SetPinConfig(PORT4, 17U, &default_config);
#endif

    /* Flexcomm Pins (UART, SPI or I2C) */
    PORT_SetPinConfig(PORT1, 8U, &default_config);
    PORT_SetPinConfig(PORT1, 9U, &default_config);
    PORT_SetPinConfig(PORT3, 2U, &default_config);
    PORT_SetPinConfig(PORT3, 3U, &default_config);
    PORT_SetPinConfig(PORT4, 0U, &default_config);
    PORT_SetPinConfig(PORT4, 1U, &default_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
